nc: 6
channels: 6
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# backbone
backbone:
  # [from, repeats, module, args]
  # Layer 0: An anchor layer (Identity) that does nothing but provide a stable index '0'.
  - [-1, 1, Identity, []]                           # 0
  # stream one (RGB) - Starts explicitly from the anchor layer 0
  - [0, 1, MyConv, [64, 1, 3, 2]]                   # 1
  - [-1, 1, Conv, [128, 3, 2]]                      # 2
  - [-1, 3, C2f, [128, True]]                       # 3
  - [-1, 1, Conv, [256, 3, 2]]                      # 4
  - [-1, 6, C2f, [256, True]]                       # 5
  - [-1, 1, Conv, [512, 3, 2]]                      # 6
  - [-1, 6, C2f, [512, True]]                       # 7
  - [-1, 1, Conv, [1024, 3, 2]]                     # 8
  - [-1, 3, C2f, [1024, True]]                      # 9
  - [-1, 1, SPPF, [1024, 5]]                        # 10
  # stream two (IR) - Also starts explicitly from the anchor layer 0
  - [0, 1, MyConv, [64, 2, 3, 2]]                   # 11
  - [-1, 1, Conv, [128, 3, 2]]                      # 12
  - [-1, 3, C2f, [128, True]]                       # 13
  - [-1, 1, Conv, [256, 3, 2]]                      # 14
  - [-1, 6, C2f, [256, True]]                       # 15
  - [-1, 1, Conv, [512, 3, 2]]                      # 16
  - [-1, 6, C2f, [512, True]]                       # 17
  - [-1, 1, Conv, [1024, 3, 2]]                     # 18
  - [-1, 3, C2f, [1024, True]]                      # 19
  - [-1, 1, SPPF, [1024, 5]]                        # 20
  # Concat and Reduce
  - [[5, 15], 1, Concat, [1]]                       # 21
  # [out_channels, kernel_size, stride, padding, groups, dilation, activation]
  - [-1, 1, Conv, [256, 1, 1, null, 1, 1, False]]   # 22
  - [[7, 17], 1, Concat, [1]]                       # 23
  - [-1, 1, Conv, [512, 1, 1, null, 1, 1, False]]   # 24
  - [[10, 20], 1, Concat, [1]]                      # 25
  - [-1, 1, Conv, [1024, 1, 1, null, 1, 1, False]]  # 26

# head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 27
  - [[-1, 24], 1, Concat, [1]]                      # 28
  - [-1, 3, C2f, [512]]                             # 29
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 30
  - [[-1, 22], 1, Concat, [1]]                      # 31
  - [-1, 3, C2f, [256]]                             # 32
  - [-1, 1, Conv, [256, 3, 2]]                      # 33
  - [[-1, 29], 1, Concat, [1]]                      # 34
  - [-1, 3, C2f, [512]]                             # 35
  - [-1, 1, Conv, [512, 3, 2]]                      # 36
  - [[-1, 26], 1, Concat, [1]]                      # 37
  - [-1, 3, C2f, [1024]]                            # 38
  - [[32, 35, 38], 1, Detect, [nc]]                 # Detect(P3, P4, P5)
